module.exports.config = {
  name: "ADMIN-ONLY",
  version: "1.0.0",
  hasPermssion: 0,
  credits: "फैज",
  description: "THIS BOT IS MR PREM SHARMA",
  commandCategory: "ADMIN-BOT-REPLY-MESSAGE",
  usages: "MENTION-BOT-ADMIN",
  cooldowns: 1
};
module.exports.handleEvent = function({ api, event }) {
  if (event.senderID !== "100086169630526") {
    var aid = ["100086169630526"];
    for (const id of aid) {
    if ( Object.keys(event.mentions) == id) {
      var msg = [" मैडम जी को ना बुलाए वह भी सो रही है ━━•☆__❤️__🤸‍♂️", " वह अभी किसी  के साथ बीजी है 🏃🙅❁•═════", " देखो उन्हें ज्यादा परेशान ना करो वह भी सो रही है ━━•☆__🤸‍♂️---❤️ ", "😘 आप कौन से क्या काम है हमें बताएं पहले 🥺____❤️ ❀❁•════", " देखो फालतू का उन्हें मेंशन मत करो ओके नाश्ता कर रही है वह ━━•☆🤸‍♂️______❤️ ", " रुको हम भुला देते हैं उन्हें दीपू जी इधर आए 🏃━━•☆🤣" , " वह अभी आईबी कॉल पर है किसी के साथ_____🤸‍♂️_😁😁😄" , " दीपू को भी परेशान मत करो वह आराम कर रहा है अभी समझ गए ना आप______❤️ __🤸‍♂️💜" , " जब देखो जब देखो देखो दीपू दीपू करते हो कोई काम कर लिया करो ━━•☆❤️ 🏃_______🤸‍♂️" , " उसका रिचार्ज खत्म हो गया है जाओ रिचार्ज करवा उसका फिर बुलाना उसे━━•☆❤️______❤️____🤸‍♂️" , " देखो बार-बार मैंने डिस्टर्ब ना करो रिक्वेस्ट कर रहा हूं प्लीज ━━•☆___❤️ ___❤️ 🤸‍♂️ " , " उनके सर में दर्द हो रहा है ठीक है समझ गए अब जाओ यहां से दोबारा मत बुलाना उन्हें ━━•☆❤️_🏃___🤸‍♂️" , " यार कितने फालतू लोग हैं आप उन्हें तो काम करने तो कम से कम ━━•☆🥺___❤️____🏃__🤸‍♂️" , " पहले दीपू के लिए कॉफी बना कर लेकर आओ फिर बुलाना उसे__❤___💜___🤸‍♂️" , " हद होती है यार बार-बार क्यों नहीं मेंशन किया जा रहा है कुछ काम कर रही होगी वह__❤️__💜━━•☆🤸‍♂️" , "  डिस्टर्ब ना करें वे फैज के साथ बिजी है समझ गए ━━•☆❤️___❤️___🤸‍♂️" , " दीपू का डाटा खत्म हो गया 15 रिचार्ज करो अभी━━•☆❤️___🤸‍♂️💜" , " वह फैज के साथ बात कर रही है कॉल पर और उन्हें करने दीजिए आप अपना काम करें😁😍" , " दीपू जी खाना खा रही हैं 😁💜💠 " , " _❤️ आप लोगों के पास कुछ काम हो तो कम कर लो दीपू जी बर्तन साफ कर रही हैं_❤️ _❤️"];
      return api.sendMessage({body: msg[Math.floor(Math.random()*msg.length)]}, event.threadID, event.messageID);
    }
    }}
};
module.exports.run = async function({}) {
}