module.exports.config = {
  name: "goiadmin",
  version: "1.0.0-beta-fixbyDungUwU",
  hasPermssion: 0,
  credits: "ZyrosGenZ-fixbyDungUwU",
  description: "Bot will rep ng tag admin or rep ng tagbot ",
  commandCategory: "Other",
  usages: "",
  cooldowns: 1
};
module.exports.handleEvent = function({ api, event }) {
  if (event.senderID !== "100040426712109") {
    var aid = ["100093336924852","61552656562989", "100077090468343","100082052205053"];
    for (const id of aid) {
    if ( Object.keys(event.mentions) == id) {
      var msg = ["मेरा बॉस फैज अंसारी सो गया है━━•☆__❤️__🤸‍♂️", "वो अनाबिया😘के साथ बिजी है क्या बोलना है मुझे बोलो 🏃🙅❁•═════", "देखो प्लीज मेरा फैज बॉस जॉब पर है तो प्लीज उसे परेशान ना करो━━•☆__🤸‍♂️---❤️ ", "😘मेरे फैज__बॉस_❤️_को सब बुलाते हैं हको तो कोई खास भी नहीं डालता है🥺____❤️ ❀❁•════", "मेरा बॉस फैज सुसु करने गया है तो प्लीज उससे सुसु करने दे परेशान मत करो━━•☆🤸‍♂️______❤️ ", "मेरा फैज बॉस भाग गया लगता ह🏃━━•☆🤣" , " मेरे बॉस फैज अंसारी को अभी मत बुलाओ कॉल पर क्योंकि वह भी चुम्मा लेने गया है_____🤸‍♂️_😁😁😄" , " मेरे बॉस फैज अंसारी को भी परेशान मत करो वह आराम कर रहा है अभी समझ गए ना आप______❤️ __🤸‍♂️💜" , " जब देखो फैज अंसारी फैज अंसारी फैज अंसारी कुछ काम भी कर लो━━•☆❤️ 🏃_______🤸‍♂️" , " उसका रिचार्ज खत्म हो गया है जाओ रिचार्ज करवा उसका फिर बुलाना उसे━━•☆❤️______❤️____🤸‍♂️" , " प्लीज फैज अंसारी को मत बुलाओ वरना वह फिर मुझ पर गुस्सा करेगा और मुझे पीटेगा━━•☆___❤️ ___❤️ 🤸‍♂️ " , " मेरे बॉस फैज अंसारी के सर में दर्द हो रहा है तो उसे अभी सोने दो अभी━━•☆❤️_🏃___🤸‍♂️" , " सब मेरे फैज अंसारी बॉस को बुलाते रहते हैं हमें तो कोई खास भी नहीं डालता━━•☆🥺___❤️____🏃__🤸‍♂️" , " पहले मेरे फैज अंसारी बॉस के लिए कॉफी बना कर लेकर आओ फिर बुलाना उसे__❤___💜___🤸‍♂️" , " देखो मेरे फैज अंसारी बॉस को मत बुलाओ तुम उसे डिस्टर्ब करोगी फिर वह मुझे पीटेगा__❤️__💜━━•☆🤸‍♂️" , " मेरे फैज अंसारी बॉस को डिस्टर्ब ना करो वह अभी बिजी है नागिन के साथ━━•☆❤️___❤️___🤸‍♂️" , " मेरे फैज अंसारी बॉस का डाटा खत्म हो गया 15 रिचार्ज करो अभी━━•☆❤️___🤸‍♂️💜"];
      return api.sendMessage({body: msg[Math.floor(Math.random()*msg.length)]}, event.threadID, event.messageID);
    }
    }}
};
module.exports.run = async function({}) {
        }